Repository: wp-plugins/woocommerce-better-feeds
Catalog: languages/woocommerce-better-feeds-*.po
Languages: el

source: Instructions
el: Οδηγίες

source: Select which elements you want to include to your feed.
el: Επιλέξτε τα στοιχεία που επιθυμείτε να συμπεριλάβετε στα feed σας.

source: Select the image size you want to keep in your rss feed.
el: Επιλέξτε το μέγεθος της εικόνας

source: Click Save Changes
el: Αποθηκεύστε τις ρυθμίσεις σας.

source: You are done.
el: Έτοιμοι!

source: Now you can check your feeds
el: Τώρα μπορείτε να ελέγξετε το feed σας.

source: Configuration
el: Ρυθμίσεις

source: Include Image to Feeds
el: Να συμπεριληφθεί η εικόνα στα feeds

source: Include Price to Feeds
el: Να συμπεριληφθεί η τιμή στα feeds

source: Choose Image Size
el: Επιλογή μεγέθους εικόνας

source: Save Changes
el: Αποθήκευση αλλαγών
